function initHospitals() {
    return [{
        title: "三甲医院",
        config: {
            divName: 'hospital',
            circleColor: 'red',
            circleRadius: 1000,
            title: '医'
        },
        datas: [
            {
                "name": "郑州大学第一附属医院",
                "position": [113.646163, 34.752763]
            },
            {
                "name": "河南省人民医院",
                "position": [113.694448, 34.773167]
            },
            {
                "name": "河南省肿瘤医院",
                "position": [113.702006, 34.771055]
            },
            {
                "name": "河南中医学院第一附属医院",
                "position": [113.674362, 34.759018]
            },
            {
                "name": "河南省中医院",
                "position": [113.650639, 34.801329]
            },
            {
                "name": "郑州大学第二附属医院",
                "position": [113.670279, 34.766093]
            },
            {
                "name": "郑州市儿童医院",
                "position": [113.657647, 34.768677]
            },
            {
                "name": "郑州市骨科医院",
                "position": [113.637374, 34.737471]
            },
            {
                "name": "郑州人民医院",
                "position": [113.664709, 34.775374]
            },
            {
                "name": "郑州大学第五附属医院",
                "position": [113.651763, 34.743588]
            },
            {
                "name": "郑州市中医院",
                "position": [113.617272, 34.75198]
            },
            {
                "name": "河南中医学院第三附属医院",
                "position": [113.70065, 34.764599]
            },
            {
                "name": "郑州大学附属郑州中心医院",
                "position": [113.612278, 34.750303]
            },
            {
                "name": "中原油田总医院三甲",
                "position": [115.072884, 35.771516]
            },
            {
                "name": "郑州市第七人民医院",
                "position": [113.740246, 34.713565]
            },
            {
                "name": "郑州市儿童医院东区医院",
                "position": [113.753702, 34.778655]
            },
            {
                "name": "河南省中医院城东路门诊部",
                "position": [113.691606, 34.754136]
            },
            {
                "name": "郑州市第一人民医院",
                "position": [113.684496, 34.749822]
            },
            {
                "name": "郑州市心血管病医院",
                "position": [113.740246, 34.713565]
            },
            {
                "name": "武警河南总队医院",
                "position": [113.649637, 34.743004]
            },
            {
                "name": "郑州市中心医院高新区医院",
                "position": [113.567304, 34.817578]
            },
            {
                "name": "郑州大学第三附属医院（河南省妇幼保健院）",
                "position": [113.647981, 34.742724]
            },
            {
                "name": "解放军第一五三中心医院",
                "position": [113.53427, 34.764374]
            },
            {
                "name": "新郑市第二人民医院",
                "position": [113.741861, 34.397933]
            },
        ]
    }
    ];
}
