function initMetros() {
    return [
        {
            title: "1号线",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "西流湖站",
                    "position": [113.570188, 34.761135]
                },
                {
                    "name": "西三环站",
                    "position": [113.588175, 34.760193]
                },
                {
                    "name": "秦岭路站",
                    "position": [113.614308, 34.755827]
                },
                {
                    "name": "碧沙岗站",
                    "position": [113.624373, 34.75504]
                },
                {
                    "name": "绿城广场站",
                    "position": [113.633548, 34.747475]
                },
                {
                    "name": "医学院站",
                    "position": [113.642608, 34.747529]
                },
                {
                    "name": "郑州火车站",
                    "position": [113.660789, 34.746514]
                },
                {
                    "name": "二七广场站",
                    "position": [113.665854, 34.752527]
                },
                {
                    "name": "人民路站",
                    "position": [113.673865, 34.757566]
                },
                {
                    "name": "紫荆山站",
                    "position": [113.682067, 34.761919]
                },
                {
                    "name": "燕庄站",
                    "position": [113.703396, 34.76339]
                },
                {
                    "name": "民航路站",
                    "position": [113.715814, 34.763954]
                },
                {
                    "name": "会展中心站",
                    "position": [113.725738, 34.766727]
                },
                {
                    "name": "黄河南路站",
                    "position": [113.744513, 34.76286]
                },
                {
                    "name": "农业南路站",
                    "position": [113.755327, 34.765423]
                },
                {
                    "name": "东风南路站",
                    "position": [113.766607, 34.764387]
                },
                {
                    "name": "郑州东站",
                    "position": [113.778851, 34.759462]
                },
                {
                    "name": "博学路站",
                    "position": [113.792535, 34.759935]
                },
                {
                    "name": "市体育中心站",
                    "position": [113.810399, 34.7731]
                }
            ]
        },
        {
            title: "1号线(二期，2017年春节前试运营)",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "河南工业大学站",
                    "position": [113.54223, 34.82722]
                },
                {
                    "name": "郑大科技园站",
                    "position": [113.5418, 34.816862]
                },
                {
                    "name": "郑州大学站",
                    "position": [113.541457, 34.807912]
                },
                {
                    "name": "梧桐街站",
                    "position": [113.540899, 34.794134]
                },
                {
                    "name": "兰寨站",
                    "position": [113.540985, 34.783349]
                },
                {
                    "name": "铁炉站",
                    "position": [113.540768, 34.768753]
                },
                {
                    "name": "大庄站",
                    "position": [113.55405, 34.762055]
                },
                {
                    "name": "龙子湖站",
                    "position": [113.810448, 34.792827]
                },
                {
                    "name": "姚桥站",
                    "position": [113.812186, 34.808262]
                },
                {
                    "name": "后牛岗站",
                    "position": [113.812658, 34.820453]
                }
            ]
        },
        {
            title: "2号线",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "刘庄",
                    "position": [113.67897900000003, 34.843779]
                },
                {
                    "name": "柳林",
                    "position": [113.681284, 34.828431]
                },
                {
                    "name": "沙门",
                    "position": [113.68174599999998, 34.819409]
                },
                {
                    "name": "北三环",
                    "position": [113.68151799999998, 34.804971]
                },
                {
                    "name": "东风路",
                    "position": [113.68165499999998, 34.795852]
                },
                {
                    "name": "关虎屯",
                    "position": [113.68166500000001, 34.789133]
                },
                {
                    "name": "黄河路",
                    "position": [113.68204500000002, 34.77391]
                },
                {
                    "name": "紫荆山",
                    "position": [113.68206700000002, 34.761919]
                },
                {
                    "name": "东大街",
                    "position": [113.68202500000001, 34.747523]
                },
                {
                    "name": "陇海东路",
                    "position": [113.68204500000002, 34.738224]
                },
                {
                    "name": "二里岗",
                    "position": [113.682049, 34.728903]
                },
                {
                    "name": "南五里堡",
                    "position": [113.68117999999998, 34.720319]
                },
                {
                    "name": "花寨",
                    "position": [113.682389, 34.705771]
                },
                {
                    "name": "南三环",
                    "position": [113.68232499999999, 34.698847]
                },
                {
                    "name": "站马屯",
                    "position": [113.68244600000003, 34.684327]
                },
                {
                    "name": "南四环",
                    "position": [113.68189799999999, 34.662762]
                },
            ]
        },
        {
            title: "5号线（2019年12月底前试运营）",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [{"name": "桐柏路", "position": [113.61358999999999, 34.755674]}, {
                "name": "市中心医院",
                "position": [113.61358200000001, 34.747458]
            }, {"name": "大岗刘", "position": [113.613561, 34.736355]}, {
                "name": "桐淮",
                "position": [113.613606, 34.728919]
            }, {"name": "后河芦", "position": [113.62073900000001, 34.720504]}, {
                "name": "齐礼阎",
                "position": [113.62809600000003, 34.720386]
            }, {"name": "市第二人民医院", "position": [113.64401299999997, 34.720373]}, {
                "name": "京广南路",
                "position": [113.65715399999999, 34.720408]
            }, {"name": "冯庄", "position": [113.66817500000002, 34.720441]}, {
                "name": "南五里堡",
                "position": [113.68182300000001, 34.720504]
            }, {"name": "弓庄", "position": [113.69043799999997, 34.720831]}, {
                "name": "航海广场",
                "position": [113.706164, 34.720933]
            }, {"name": "七里河", "position": [113.72197299999999, 34.720926]}, {
                "name": "中原福塔",
                "position": [113.73367100000002, 34.720921]
            }, {"name": "鲍湖", "position": [113.746916, 34.720936]}, {
                "name": "经开中心广场",
                "position": [113.764635, 34.720921]
            }, {"name": "李南岗", "position": [113.77391999999998, 34.726983]}, {
                "name": "东二十里铺",
                "position": [113.773818, 34.7445]
            }, {"name": "榆林", "position": [113.77383399999997, 34.751258]}, {
                "name": "郑州东站",
                "position": [113.773526, 34.759141]
            }, {"name": "金庄", "position": [113.77080000000001, 34.769334]}, {
                "name": "祭城",
                "position": [113.767068, 34.776583]
            }, {"name": "市儿童医院", "position": [113.75128000000001, 34.776185]}, {
                "name": "湿地公园",
                "position": [113.72958599999998, 34.778815]
            }, {"name": "众意西路", "position": [113.718863, 34.776253]}, {
                "name": "姚寨",
                "position": [113.70840099999998, 34.7747]
            }, {"name": "省人民医院", "position": [113.69259999999997, 34.774654]}, {
                "name": "黄河路",
                "position": [113.68258000000003, 34.774632]
            }, {"name": "郑州人民医院", "position": [113.66686600000003, 34.774576]}, {
                "name": "海滩寺",
                "position": [113.64989000000003, 34.774199]
            }, {"name": "沙口路", "position": [113.63964099999998, 34.770191]}, {
                "name": "月季公园",
                "position": [113.62273199999998, 34.765735]
            }]
        },
        {
            title: "2号线（南延段，2020年7月底试运营）",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [{"name": "新郑机场", "position": [113.84578999999997, 34.528172]}, {
                "name": "综保区",
                "position": [113.85710799999998, 34.548907]
            }, {"name": "恩平湖", "position": [113.85969499999999, 34.568316]}, {
                "name": "兰河公园",
                "position": [113.859712, 34.575833]
            }, {"name": "康平湖", "position": [113.85313100000002, 34.584812]}, {
                "name": "港区北",
                "position": [113.83588299999997, 34.584823]
            }, {"name": "孟庄", "position": [113.81697099999997, 34.585269]}, {
                "name": "华南城东",
                "position": [113.77369099999999, 34.593978]
            }, {"name": "华南城", "position": [113.74874, 34.594007]}, {
                "name": "华南城西",
                "position": [113.725573, 34.593886]
            }, {"name": "小乔", "position": [113.69389699999999, 34.600424]}, {
                "name": "后胡",
                "position": [113.68284800000004, 34.61047]
            }, {"name": "沙窝李", "position": [113.68134099999997, 34.627126]}, {
                "name": "十八里河",
                "position": [113.682075, 34.647754]
            }, {"name": "南四环", "position": [113.68189799999999, 34.662762]}]
        },
        {
            title: "3号线（预测，2020年12月底试运营）",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "省体育中心",
                    "position": [113.625883, 34.832521]
                }, {
                    "name": "西史赵",
                    "position": [113.626055,34.820966]
                }, {
                    "name": "兴隆铺",
                    "position": [113.630046,34.809727]
                }, {
                    "name": "同乐",
                    "position": [113.635539,34.795561]
                }, {
                    "name": "寺坡",
                    "position": [113.642234,34.785728]
                }, {
                    "name": "海滩寺",
                    "position": [113.649787,34.774096]
                }, {
                    "name": "西太康路",
                    "position": [113.656911,34.764366]
                }, {
                    "name": "二七广场",
                    "position": [113.665666,34.752449]
                }, {
                    "name": "西大街",
                    "position": [113.675322,34.750598]
                },{
                    "name": "东大街",
                    "position": [113.682059,34.748658]
                }, {
                    "name": "东门口",
                    "position": [113.691372,34.746895]
                }, {
                    "name": "晋王庙",
                    "position": [113.703946,34.746895]
                }, {
                    "name": "凤凰台",
                    "position": [113.714203,34.746931]
                }, {
                    "name": "东十里铺",
                    "position": [113.725833,34.746895]
                }, {
                    "name": "通泰路",
                    "position": [113.734116,34.748094]
                }, {
                    "name": "中周",
                    "position": [113.746604,34.747918]
                }, {
                    "name": "东周",
                    "position": [113.758835,34.746613]
                }, {
                    "name": "东二十里铺",
                    "position": [113.773855,34.744427]
                }, {
                    "name": "莆田营",
                    "position": [113.792781,34.7421]
                }, {
                    "name": "营岗",
                    "position": [113.805269,34.728451]
                }
            ]
        },
        {
            title: "4号线（预测，2020年12月底前试运营）",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "老鸦陈",
                    "position": [113.609515,34.832222]
                }, {
                    "name": "省体育中心",
                    "position": [113.626187,34.83238]
                }, {
                    "name": "北二十里铺",
                    "position": [113.640843,34.830725]
                }, {
                    "name": "张家村",
                    "position": [113.660745,34.824745]
                }, {
                    "name": "沙门",
                    "position": [113.681763,34.819205]
                }, {
                    "name": "杨君刘",
                    "position": [113.698114,34.819522]
                }, {
                    "name": "安庄",
                    "position": [113.707126,34.830831]
                }, {
                    "name": "民丰街",
                    "position": [113.718305,34.833569]
                }, {
                    "name": "民安街",
                    "position": [113.734527,34.831403]
                }, {
                    "name": "龙湖",
                    "position": [113.733497,34.822103]
                },{
                    "name": "龙湖南",
                    "position": [113.732296,34.807551]
                }, {
                    "name": "朝阳路",
                    "position": [113.733465,34.797931]
                }, {
                    "name": "春意桥",
                    "position": [113.731942,34.788609]
                }, {
                    "name": "湿地公园",
                    "position": [113.727886,34.779533]
                }, {
                    "name": "会展中心",
                    "position": [113.725697,34.766949]
                }, {
                    "name": "商鼎西",
                    "position": [113.726084,34.757429]
                }, {
                    "name": "东十里铺",
                    "position": [113.72574,34.746992]
                }, {
                    "name": "白庄",
                    "position": [113.727328,34.739164]
                }, {
                    "name": "七里河",
                    "position": [113.722286,34.720894]
                }, {
                    "name": "金代李",
                    "position": [113.72117,34.713116]
                }, {
                    "name": "文德北",
                    "position": [113.725204,34.704913]
                }, {
                    "name": "鼎尚街",
                    "position": [113.731191,34.694928]
                }, {
                    "name": "鼎瑞街",
                    "position": [113.734044,34.690183]
                }
            ]
        },
        {
            title: "6号线（预测，2020年12月底试运营）",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "金水村",
                    "position": [113.708209,34.875776]
                }, {
                    "name": "马头岗西",
                    "position": [113.71499,34.850705]
                }, {
                    "name": "民丰街",
                    "position": [113.718305001,34.833468]
                }, {
                    "name": "森林公园",
                    "position": [113.71691,34.80704]
                }, {
                    "name": "小营",
                    "position": [113.717168,34.790512]
                }, {
                    "name": "姚寨",
                    "position": [113.708628,34.774695]
                }, {
                    "name": "燕庄",
                    "position": [113.703435,34.763194]
                }, {
                    "name": "东沈庄",
                    "position": [113.703628,34.754873]
                }, {
                    "name": "晋王庙",
                    "position": [113.7038,34.746939]
                }, {
                    "name": "凤凰城",
                    "position": [113.700259,34.737541]
                },{
                    "name": "魏树林",
                    "position": [113.69526,34.72973]
                }, {
                    "name": "二里岗",
                    "position": [113.682106,34.728848]
                }, {
                    "name": "富华街",
                    "position": [113.656679,34.728989]
                }, {
                    "name": "曹寨",
                    "position": [113.644083,34.728954]
                }, {
                    "name": "嵩淮",
                    "position": [113.62814,34.728883]
                }, {
                    "name": "桐淮",
                    "position": [113.613592,34.72883]
                }, {
                    "name": "西三环",
                    "position": [113.590289,34.729183]
                }, {
                    "name": "传媒中心",
                    "position": [113.557737,34.741394]
                }, {
                    "name": "奥体中心",
                    "position": [113.531731,34.741394]
                }, {
                    "name": "桐树王",
                    "position": [113.508385,34.732436]
                }, {
                    "name": "燕沟",
                    "position": [113.516882,34.722208]
                }, {
                    "name": "马寨",
                    "position": [113.515423,34.708133]
                }, {
                    "name": "贾峪周桐",
                    "position": [113.499201,34.693738]
                }, {
                    "name": "洞林湖",
                    "position": [113.482292,34.684351]
                }, {
                    "name": "贾峪",
                    "position": [113.464354,34.683398]
                }
            ]
        },
        {
            title: "7号线（预测，市区部分，2022年12月底前试运营）",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "迎宾馆北",
                    "position": [113.642924,34.878971]
                },                {
                    "name": "迎宾馆南",
                    "position": [113.644898,34.866578]
                }, {
                    "name": "英才街",
                    "position": [113.646873,34.858479]
                }, {
                    "name": "琉璃寺",
                    "position": [113.654984,34.838827]
                }, {
                    "name": "张家村",
                    "position": [113.660563,34.824525]
                }, {
                    "name": "陈砦立交桥",
                    "position": [113.664768,34.81015]
                }, {
                    "name": "白庙",
                    "position": [113.665798,34.799649]
                }, {
                    "name": "河南农业大学",
                    "position": [113.666571,34.787032]
                }, {
                    "name": "市人民医院",
                    "position": [113.666742,34.774695]
                }, {
                    "name": "西太康路",
                    "position": [113.656786,34.76426]
                }, {
                    "name": "医学院",
                    "position": [113.642624,34.747195]
                },{
                    "name": "路砦",
                    "position": [113.643997,34.739366]
                }, {
                    "name": "曹寨",
                    "position": [113.643997,34.728962]
                }, {
                    "name": "第二人民医院",
                    "position": [113.643997,34.720409]
                }, {
                    "name": "大学南路长江中路",
                    "position": [113.643911,34.709914]
                }, {
                    "name": "荆胡",
                    "position": [113.643997,34.694531]
                }, {
                    "name": "二七新城",
                    "position": [113.644019,34.676234]
                }, {
                    "name": "铁三官庙",
                    "position": [113.64389,34.659716]
                }, {
                    "name": "古城",
                    "position": [113.646207,34.616639]
                }, {
                    "name": "司家嘴",
                    "position": [113.650499,34.553042]
                }
            ]
        },
        {
            title: "8号线（预测，市区部分，2021年12月底前试运营）",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "郑州轻工业学院",
                    "position": [113.514114,34.807595]
                },                {
                    "name": "郑州大学",
                    "position": [113.541623,34.807595]
                }, {
                    "name": "丁香里",
                    "position": [113.558488,34.807666]
                }, {
                    "name": "郑州美术馆",
                    "position": [113.568616,34.797975]
                }, {
                    "name": "老俩河",
                    "position": [113.586255,34.793799]
                }, {
                    "name": "大学科技园",
                    "position": [113.605395,34.792671]
                }, {
                    "name": "同乐",
                    "position": [113.635607,34.795632]
                }, {
                    "name": "绿荫公园",
                    "position": [113.648053,34.799226]
                }, {
                    "name": "白庙",
                    "position": [113.665906,34.799367]
                }, {
                    "name": "东风路",
                    "position": [113.681698,34.796548]
                }, {
                    "name": "枣庄",
                    "position": [113.693243,34.794856]
                },{
                    "name": "小营",
                    "position": [113.716074,34.790874]
                }, {
                    "name": "春意桥",
                    "position": [113.735171,34.788512]
                }, {
                    "name": "陈岗",
                    "position": [113.754268,34.785798]
                }, {
                    "name": "庙张",
                    "position": [113.77328,34.782944]
                }, {
                    "name": "郑州东站",
                    "position": [113.773537,34.759183]
                }, {
                    "name": "莆田营",
                    "position": [113.792549,34.742188]
                }
            ]
        },
        {
            title: "9号线（预测，市区部分，2021年12月底前试运营）",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "大师姑",
                    "position": [113.494942,34.844427]
                },                {
                    "name": "西连河",
                    "position": [113.507302,34.837594]
                }, {
                    "name": "沟赵",
                    "position": [113.522236,34.827871]
                }, {
                    "name": "河南工业大学",
                    "position": [113.542493,34.827167]
                }, {
                    "name": "东史马",
                    "position": [113.557513,34.827026]
                }, {
                    "name": "石佛",
                    "position": [113.578284,34.81695]
                }, {
                    "name": "电厂南路",
                    "position": [113.606565,34.801164]
                }, {
                    "name": "大学科技园",
                    "position": [113.604505,34.792002]
                }, {
                    "name": "冉屯路",
                    "position": [113.601501,34.778044]
                }, {
                    "name": "冉屯东路",
                    "position": [113.608453,34.769337]
                }, {
                    "name": "月季公园",
                    "position": [113.622787,34.765776]
                },{
                    "name": "碧沙岗",
                    "position": [113.624375,34.754988]
                }, {
                    "name": "绿城广场",
                    "position": [113.633559,34.74723]
                }, {
                    "name": "隋河宋肆",
                    "position": [113.628688,34.736316]
                }, {
                    "name": "嵩淮",
                    "position": [113.628173,34.728821]
                }, {
                    "name": "齐礼闫",
                    "position": [113.628152,34.720321]
                }, {
                    "name": "黄岗寺北",
                    "position": [113.628066,34.709879]
                }, {
                    "name": "黄岗寺",
                    "position": [113.628924,34.697689]
                }, {
                    "name": "贾咀",
                    "position": [113.628152,34.674064]
                }, {
                    "name": "铁三官庙",
                    "position": [113.643901,34.658551]
                }, {
                    "name": "青天芦",
                    "position": [113.666046,34.659204]
                }, {
                    "name": "十八里河",
                    "position": [113.682225,34.647695]
                }
            ]
        },
        {
            title: "10号线（预测，市区部分，2020年12月底前试运营）",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "新田大道北",
                    "position": [113.505242,34.748394]
                },                {
                    "name": "市民广场",
                    "position": [113.540272,34.747557]
                }, {
                    "name": "郑州一中",
                    "position": [113.558103,34.747468]
                }, {
                    "name": "杏树湾",
                    "position": [113.578423,34.747363]
                }, {
                    "name": "罗庄",
                    "position": [113.595021,34.747601]
                }, {
                    "name": "市中心医院",
                    "position": [113.613462,34.747422]
                }, {
                    "name": "绿城广场",
                    "position": [113.632924,34.747422]
                }, {
                    "name": "医学院",
                    "position": [113.642794,34.747369]
                }, {
                    "name": "郑州火车站",
                    "position": [113.656227,34.74654]
                }
            ]
        },
    ];
}
