function initMetros() {
    return [
        {
            title: "一号线",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "西流湖站",
                    "position": [113.570188, 34.761135]
                },
                {
                    "name": "西三环站",
                    "position": [113.588175, 34.760193]
                },
                {
                    "name": "秦岭路站",
                    "position": [113.614308, 34.755827]
                },
                {
                    "name": "碧沙岗站",
                    "position": [113.624373, 34.75504]
                },
                {
                    "name": "绿城广场站",
                    "position": [113.633548, 34.747475]
                },
                {
                    "name": "医学院站",
                    "position": [113.642608, 34.747529]
                },
                {
                    "name": "郑州火车站",
                    "position": [113.660789, 34.746514]
                },
                {
                    "name": "二七广场站",
                    "position": [113.665854, 34.752527]
                },
                {
                    "name": "人民路站",
                    "position": [113.673865, 34.757566]
                },
                {
                    "name": "紫荆山站",
                    "position": [113.682067, 34.761919]
                },
                {
                    "name": "燕庄站",
                    "position": [113.703396, 34.76339]
                },
                {
                    "name": "民航路站",
                    "position": [113.715814, 34.763954]
                },
                {
                    "name": "会展中心站",
                    "position": [113.725738, 34.766727]
                },
                {
                    "name": "黄河南路站",
                    "position": [113.744513, 34.76286]
                },
                {
                    "name": "农业南路站",
                    "position": [113.755327, 34.765423]
                },
                {
                    "name": "东风南路站",
                    "position": [113.766607, 34.764387]
                },
                {
                    "name": "郑州东站",
                    "position": [113.778851, 34.759462]
                },
                {
                    "name": "博学路站",
                    "position": [113.792535, 34.759935]
                },
                {
                    "name": "市体育中心站",
                    "position": [113.810399, 34.7731]
                }
            ]
        },
        {
            title: "一号线(二期)",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "河南工业大学站",
                    "position": [113.54223, 34.82722]
                },
                {
                    "name": "郑大科技园站",
                    "position": [113.5418, 34.816862]
                },
                {
                    "name": "郑州大学站",
                    "position": [113.541457, 34.807912]
                },
                {
                    "name": "梧桐街站",
                    "position": [113.540899, 34.794134]
                },
                {
                    "name": "兰寨站",
                    "position": [113.540985, 34.783349]
                },
                {
                    "name": "铁炉站",
                    "position": [113.540768, 34.768753]
                },
                {
                    "name": "大庄站",
                    "position": [113.55405, 34.762055]
                },
                {
                    "name": "龙子湖站",
                    "position": [113.810448, 34.792827]
                },
                {
                    "name": "姚桥站",
                    "position": [113.812186, 34.808262]
                },
                {
                    "name": "后牛岗站",
                    "position": [113.812658, 34.820453]
                }
            ]
        },
        {
            title: "二号线",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [
                {
                    "name": "刘庄",
                    "position": [113.67897900000003, 34.843779]
                },
                {
                    "name": "柳林",
                    "position": [113.681284, 34.828431]
                },
                {
                    "name": "沙门",
                    "position": [113.68174599999998, 34.819409]
                },
                {
                    "name": "北三环",
                    "position": [113.68151799999998, 34.804971]
                },
                {
                    "name": "东风路",
                    "position": [113.68165499999998, 34.795852]
                },
                {
                    "name": "关虎屯",
                    "position": [113.68166500000001, 34.789133]
                },
                {
                    "name": "黄河路",
                    "position": [113.68204500000002, 34.77391]
                },
                {
                    "name": "紫荆山",
                    "position": [113.68206700000002, 34.761919]
                },
                {
                    "name": "东大街",
                    "position": [113.68202500000001, 34.747523]
                },
                {
                    "name": "陇海东路",
                    "position": [113.68204500000002, 34.738224]
                },
                {
                    "name": "二里岗",
                    "position": [113.682049, 34.728903]
                },
                {
                    "name": "南五里堡",
                    "position": [113.68117999999998, 34.720319]
                },
                {
                    "name": "花寨",
                    "position": [113.682389, 34.705771]
                },
                {
                    "name": "南三环",
                    "position": [113.68232499999999, 34.698847]
                },
                {
                    "name": "站马屯",
                    "position": [113.68244600000003, 34.684327]
                },
                {
                    "name": "南四环",
                    "position": [113.68189799999999, 34.662762]
                },
            ]
        },
        {
            title: "五号线",
            config: {
                divName: 'metro',
                circleColor: 'fuchsia',
                circleRadius: 1000,
                title: '地'
            },
            datas: [{"name": "桐柏路", "position": [113.61358999999999, 34.755674]}, {
                "name": "市中心医院",
                "position": [113.61358200000001, 34.747458]
            }, {"name": "大岗刘", "position": [113.613561, 34.736355]}, {
                "name": "桐淮",
                "position": [113.613606, 34.728919]
            }, {"name": "后河芦", "position": [113.62073900000001, 34.720504]}, {
                "name": "齐礼阎",
                "position": [113.62809600000003, 34.720386]
            }, {"name": "市第二人民医院", "position": [113.64401299999997, 34.720373]}, {
                "name": "京广南路",
                "position": [113.65715399999999, 34.720408]
            }, {"name": "冯庄", "position": [113.66817500000002, 34.720441]}, {
                "name": "南五里堡",
                "position": [113.68182300000001, 34.720504]
            }, {"name": "弓庄", "position": [113.69043799999997, 34.720831]}, {
                "name": "航海广场",
                "position": [113.706164, 34.720933]
            }, {"name": "七里河", "position": [113.72197299999999, 34.720926]}, {
                "name": "中原福塔",
                "position": [113.73367100000002, 34.720921]
            }, {"name": "鲍湖", "position": [113.746916, 34.720936]}, {
                "name": "经开中心广场",
                "position": [113.764635, 34.720921]
            }, {"name": "李南岗", "position": [113.77391999999998, 34.726983]}, {
                "name": "东二十里铺",
                "position": [113.773818, 34.7445]
            }, {"name": "榆林", "position": [113.77383399999997, 34.751258]}, {
                "name": "郑州东站",
                "position": [113.773526, 34.759141]
            }, {"name": "金庄", "position": [113.77080000000001, 34.769334]}, {
                "name": "祭城",
                "position": [113.767068, 34.776583]
            }, {"name": "市儿童医院", "position": [113.75128000000001, 34.776185]}, {
                "name": "湿地公园",
                "position": [113.72958599999998, 34.778815]
            }, {"name": "众意西路", "position": [113.718863, 34.776253]}, {
                "name": "姚寨",
                "position": [113.70840099999998, 34.7747]
            }, {"name": "省人民医院", "position": [113.69259999999997, 34.774654]}, {
                "name": "黄河路",
                "position": [113.68258000000003, 34.774632]
            }, {"name": "郑州人民医院", "position": [113.66686600000003, 34.774576]}, {
                "name": "海滩寺",
                "position": [113.64989000000003, 34.774199]
            }, {"name": "沙口路", "position": [113.63964099999998, 34.770191]}, {
                "name": "月季公园",
                "position": [113.62273199999998, 34.765735]
            }]
        },
    ];
}
