function initSchools() {
    return [
        {
            title: "省级示范中学",
            config: {
                divName: 'school',
                circleColor: 'green',
                circleRadius: 2000,
                title: '中'
            },
            datas: [
                {
                    "name": "郑州市第一中学",
                    "position": [113.560775, 34.747871]
                },
                {
                    "name": "北大附中河南分校",
                    "position": [113.711716, 34.788056]
                },
                {
                    "name": "郑州外国语学校",
                    "position": [113.562713, 34.815606]
                },
                {
                    "name": "郑州市第十二中学",
                    "position": [113.622092, 34.818497]
                },
                {
                    "name": "河南省实验中学",
                    "position": [113.668638, 34.791497]
                },
                {
                    "name": "郑州十六中",
                    "position": [113.618969, 34.751426]
                },
                {
                    "name": "巩义市第二中学",
                    "position": [112.973372, 34.723917]
                },
                {
                    "name": "郑州市回民中学",
                    "position": [113.696344, 34.754822]
                },
                {
                    "name": "郑州市第二中学",
                    "position": [113.638838, 34.739324]
                },
                {
                    "name": "郑州十九中",
                    "position": [113.634362, 34.735816]
                },
                {
                    "name": "河南省荥阳市高级中学",
                    "position": [113.363417, 34.787486]
                },
                {
                    "name": "郑州106中学",
                    "position": [113.650732, 34.746792]
                },
                {
                    "name": "郑州市第四中学",
                    "position": [113.65032, 34.748667]
                },
                {
                    "name": "郑州四十七中",
                    "position": [113.739685, 34.770481]
                },
                {
                    "name": "中牟县第一高级中学",
                    "position": [113.970183, 34.714422]
                },
                {
                    "name": "郑州市第十一中学",
                    "position": [113.73532, 34.715633]
                },
                {
                    "name": "郑州市第七中学",
                    "position": [113.668513, 34.830983]
                },
                {
                    "name": "郑州中学",
                    "position": [113.570956, 34.800016]
                },
                {
                    "name": "新密市第一高级中学",
                    "position": [113.388457, 34.537959]
                },
                {
                    "name": "登封一中",
                    "position": [113.024524, 34.448396]
                },
                {
                    "name": "郑州市第九中学",
                    "position": [113.664677, 34.788678]
                },
                {
                    "name": "郑州101中学",
                    "position": [113.664858, 34.73814]
                },
                {
                    "name": "新密市实验高级中学",
                    "position": [113.380506, 34.545171]
                }
            ]
        },
        {
            title: "重点小学",
            config: {
                divName: 'school',
                circleColor: 'blue',
                circleRadius: 2000,
                title: '小'
            },
            datas: [
                {
                    "name": "文化路一小",
                    "position": [113.667386,34.789633]
                },
                {
                    "name": "河南省实验中学思达外国语小学",
                    "position": [113.632132,34.807872]
                },
                {
                    "name": "纬五路一小",
                    "position": [113.680345,34.772697]
                },
                {
                    "name": "农科路小学",
                    "position": [113.686819,34.792844]
                },
                {
                    "name": "河南省实验小学",
                    "position": [113.696054,34.76721]
                },
                {
                    "name": "文化绿城双语小学",
                    "position": [113.648945,34.808407]
                },
                {
                    "name": "纬五路二小",
                    "position": [113.690648,34.772575]
                },
                {
                    "name": "纬三路小学",
                    "position": [113.673087,34.770909]
                },
                {
                    "name": "优胜路小学",
                    "position": [113.660069,34.76867]
                },
                {
                    "name": "黄河路第一小学",
                    "position": [113.674286,34.775302]
                },
                {
                    "name": "郑州师范附属小学",
                    "position": [113.669744,34.759923]
                },
                {
                    "name": "聚源路小学",
                    "position": [113.740799,34.756231]
                },
                {
                    "name": "河南省实验学校郑东小学",
                    "position": [113.74398,34.779755]
                },
                {
                    "name": "众意路小学",
                    "position": [113.726639,34.783633]
                },
                {
                    "name": "康平路小学",
                    "position": [113.762844,34.748704]
                },
                {
                    "name": "郑东新区外国语小学",
                    "position": [113.736924,34.774334]
                },
                {
                    "name": "东关小学",
                    "position": [113.693603,34.751108]
                },
                {
                    "name": "创新街小学",
                    "position": [113.681027,34.745903]
                },
                {
                    "name": "管城区外国语小学",
                    "position": [113.691868,34.740994]
                },
                {
                    "name": "郑州市管城区回民一小",
                    "position": [113.67331,34.752008]
                },
                {
                    "name": "政通路小学",
                    "position": [113.638336,34.724985]
                },
                {
                    "name": "陇西小学",
                    "position": [113.647785,34.735905]
                },
                {
                    "name": "幸福路小学",
                    "position": [113.650265,34.740546]
                },
                {
                    "name": "建新街小学",
                    "position": [113.647972,34.75679]
                },
                {
                    "name": "二七区实验小学",
                    "position": [113.649021,34.739374]
                },
                {
                    "name": "东风路小学",
                    "position": [113.637778,34.798378]
                },
                {
                    "name": "江山路第一小学",
                    "position": [113.619475,34.815574]
                },
                {
                    "name": "惠济区实验小学",
                    "position": [113.625137,34.865573]
                },
                {
                    "name": "伊河路小学",
                    "position": [113.621443,34.742845]
                },
                {
                    "name": "互助路小学",
                    "position": [113.618672,34.750093]
                },
                {
                    "name": "中原区外国语小学",
                    "position": [113.615874,34.738271]
                },
                {
                    "name": "建设路第二小学",
                    "position": [113.610817,34.75231]
                },
                {
                    "name": "淮河路小学",
                    "position": [113.615104,34.728519]
                },
                {
                    "name": "伏牛路小学",
                    "position": [113.606677,34.746072]
                },
                {
                    "name": "中原区特色实验小学",
                    "position": [113.606736,34.744269]
                },
                {
                    "name": "艾瑞德国际学校",
                    "position": [113.539016,34.829242]
                },
                {
                    "name": "郑州中学附属小学",
                    "position": [113.572087,34.796872]
                },
                {
                    "name": "郑州大学实验小学",
                    "position": [113.550333,34.816121]
                },
                {
                    "name": "新郑市新华路小学",
                    "position": [113.746017,34.389246]
                },
                {
                    "name": "郑州中学第二附属小学",
                    "position": [113.574736,34.78089]
                },
                {
                    "name": "汝河新区小学",
                    "position": [113.610634,34.730407]
                },
                {
                    "name": "金水区艺术小学",
                    "position": [113.672926,34.831951]
                },
                {
                    "name": "金水区实验小学",
                    "position": [113.643094,34.780499]
                },
                {
                    "name": "经三路小学",
                    "position": [113.693271,34.764991]
                },
                {
                    "name": "一八联合国际小学",
                    "position": [113.637756,34.820322]
                },
                {
                    "name": "中方园双语小学",
                    "position": [113.65709,34.818386]
                },
                {
                    "name": "淮河东路小学",
                    "position": [113.653385,34.728573]
                },
                {
                    "name": "棉纺路小学",
                    "position": [113.634462,34.757162]
                },
                {
                    "name": "建业小哈佛小学",
                    "position": [113.717801,34.768129]
                },
                {
                    "name": "汝河路小学",
                    "position": [113.636978,34.730368]
                },
                {
                    "name": "四月天小学",
                    "position": [113.65415,34.820858]
                },
                {
                    "name": "新郑市实验小学",
                    "position": [113.736736,34.398191]
                },
                {
                    "name": "新郑市外国语小学",
                    "position": [113.753938,34.379437]
                },
                {
                    "name": "逸夫小学",
                    "position": [113.67415,34.734644]
                },
                {
                    "name": "二七区外国语小学（中原路小学）",
                    "position": [113.639644,34.747792]
                },
                {
                    "name": "二七区铭功路小学",
                    "position": [113.658369,34.758953]
                },
                {
                    "name": "河南省实验小学外国语分校",
                    "position": [113.699357,34.797442]
                },
                {
                    "name": "南学街小学",
                    "position": [113.672824,34.748423]
                }
            ]
        }
    ];
}
